import 'package:flutter/material.dart';

class Shlok28_29 extends StatefulWidget {
  const Shlok28_29({super.key});

  @override
  State<Shlok28_29> createState() => _Shlok28_29State();
}

class _Shlok28_29State extends State<Shlok28_29> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        leading: IconButton(
          icon: const Icon(Icons.arrow_back),
          onPressed: () {
            Navigator.pop(context);
          },
        ),
        title: const Text('श्लोक 28, 29'),
      ),
      body: SingleChildScrollView(
        padding: const EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: const [
            Text(
              'श्लोक',
              style: TextStyle(fontSize: 18, fontWeight: FontWeight.bold),
            ),
            Text(
              '(मोह से व्याप्त हुए अर्जुन के कायरता, स्नेह और शोकयुक्त वचन )\n'
                  'अर्जुन उवाच\n'
                  'दृष्ट्वेमं स्वजनं कृष्ण युयुत्सुं समुपास्थितम्।\n'
                  'सीदन्ति मम गात्राणि मुखं च परिशुष्यति॥28॥', // Sanskrit Shlok 28
            ),
            SizedBox(height: 12),
            Text(
              'हिंदी अनुवाद: \n',
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            Text(
              'अर्जुन बोले- हे कृष्ण! युद्ध क्षेत्र में डटे हुए युद्ध के '
                  'अभिलाषी इस स्वजन-समुदाय को देखकर मेरे अंग '
                  'शिथिल हुए जा रहे हैं और मुख सूखा जा रहा है तथा '
                  'मेरे शरीर में कम्प एवं रोमांच (रोम-रोम में सिहरन) हो रहा है।\n'
                  '॥28वें का उत्तरार्ध और 29॥', // Hindi Translation Shlok 28-29
            ),
            SizedBox(height: 20),
            Text(
              'व्याख्या:\n',
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            Text(
              'इस श्लोक में अर्जुन अपने गहरे शोक और चिंता को '
                  'व्यक्त कर रहा है। युद्धभूमि पर अपने ही कुटुंबियों '
                  'और मित्रों को सैन्यबल के रूप में देखकर अर्जुन '
                  'अत्यंत उदास और भयभीत हो जाता है। उसके '
                  'अंगों में कंपन और मुख में सूखापन उसकी मानसिक '
                  'स्थिति को प्रकट करते हैं। यह स्थिति अर्जुन की '
                  'मनोवैज्ञानिक संघर्ष और युद्ध के नैतिकता को लेकर '
                  'उलझन को दर्शाती है, जो उसके मन में आ रही '
                  'असहायता और चिंता को प्रकट करती है। अर्जुन '
                  'की यह अवस्था इस बात को दिखाती है कि युद्ध की '
                  'परिस्थितियों में व्यक्ति किस प्रकार अपनी भावनाओं '
                  'और रिश्तों के प्रति संवेदनशील हो जाता है।',
            ),
            SizedBox(height: 10),
            Text(
              'इस श्लोक में अर्जुन ने अपनी व्यथा और असमर्थता '
                  'का वर्णन किया है, जब उन्होंने कुरुक्षेत्र के युद्धभूमि '
                  'को देखा। यहां पर अर्जुन कह रहे हैं कि उनके शरीर में '
                  'वेपथु (अधिक चंचलता) और रोमांच (रोम-रोम में '
                  'सिहरन) हो रहा है।',
            ),
            SizedBox(height: 10),
            Text(
              'श्लोक का भावार्थ है: "मेरे शरीर में एक अजीब सी '
                  'चंचलता और रोमांच उत्पन्न हो रहा है। मेरी उँगलियों '
                  'से गाण्डीव (धनुष) गिर रहा है, और मेरी त्वचा भी '
                  'जल रही है।"',
            ),
            SizedBox(height: 10),
            Text(
              'अर्जुन के इस श्लोक में उनके भीतर उठ रही चिंता, '
                  'भय और तनाव को व्यक्त किया गया है। युद्ध की '
                  'तैयारी और उसका भय अर्जुन के शरीर और मन '
                  'दोनों पर प्रभाव डाल रहा है। उनके हाथ से धनुष '
                  'गिर रहा है, और उन्हें लगता है कि उनकी त्वचा जल '
                  'रही है, जो युद्ध के प्रति उनके मनोवैज्ञानिक '
                  'को दर्शाता है। यह श्लोक युद्ध के प्रारंभिक '
                  'अर्जुन की मानसिक स्थिति को स्पष्ट करता है और '
                  'दर्शाता है कि वह युद्ध के परिणाम और इसके '
                  'को लेकर अत्यंत चिंतित हैं।',
            ),
            SizedBox(height: 10),
            Text(
              'संजय के अनुसार, अर्जुन ने युद्ध के दौरान अपने '
                  'मन को शोक और चिंता से भरा हुआ पाया और '
                  'उसने अपने धनुष को छोड़ दिया। यह संकेत करता '
                  'है कि अर्जुन इस समय युद्ध के गंभीरता और '
                  'परिणामों से घबराया हुआ और मानसिक रूप से '
                  'विचलित था।',
            ),
            SizedBox(height: 10),
            Text(
              'यह श्लोक अर्जुन की दुविधा और संघर्ष को '
                  'है। वह युद्ध की आवश्यकता और उसके नैतिक '
                  'को लेकर अंदर ही अंदर एक गंभीर संकट से गुजर '
                  'रहा था। यह स्थिति युद्ध के आह्वान के बावजूद '
                  'उसके आंतरिक संकट को दर्शाती है।',
            ),
          ],
        ),
      ),
    );
  }
}