import 'package:flutter/material.dart';

class Shlok38_39 extends StatefulWidget {
  const Shlok38_39({super.key});

  @override
  State<Shlok38_39> createState() => _Shlok38_39State();
}

class _Shlok38_39State extends State<Shlok38_39> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        leading: IconButton(
          icon: const Icon(Icons.arrow_back),
          onPressed: () {
            Navigator.pop(context);
          },
        ),
        title: const Text('श्लोक 38, 39'),
      ),
      body: SingleChildScrollView(
        padding: const EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: const [
            Text(
              'श्लोक',
              style: TextStyle(fontSize: 18, fontWeight: FontWeight.bold),
            ),
            Text(
              'यद्यप्येते न पश्यन्ति लोभोपहतचेतसः।\n'
                  'कुलक्षयकृतं दोषं मित्रद्रोहे च पातकम्॥\n'
                  'कथं न ज्ञेयमस्माभिः पापादस्मान्निवर्तितुम्।\n'
                  'कुलक्षयकृतं दोषं प्रपश्यद्भिर्जनार्दन॥38-39॥', // Sanskrit Shlok 38-39
            ),
            SizedBox(height: 12),
            Text(
              'हिंदी अनुवाद: \n',
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            Text(
              'यद्यपि लोभ से भ्रष्ट हुए ये लोग कुल के नाश से उत्पन्न '
                  'दोष को और मित्रों से विरोध करने में पाप को '
                  'नहीं देखते, तो भी हे जनार्दन! कुल के नाश से उत्पन्न '
                  'दोष को जानने वाले हम लोगों को इस पाप से हटने '
                  'के लिए क्यों नहीं विचार करना चाहिए? '
                  '॥38-39॥', // Hindi Translation Shlok 38-39
            ),
            SizedBox(height: 20),
            Text(
              'व्याख्या:\n',
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            Text(
              'श्लोक 38:\n'
                  'इस श्लोक में अर्जुन उन लोगों के बारे में बात कर '
                  'रहे हैं जो युद्ध के दुष्परिणामों को देखकर भी इसे '
                  'अनदेखा कर रहे हैं। उन्होंने कहा कि भले ही ये लोग '
                  'लोभ और अन्य स्वार्थों से प्रभावित हैं, वे कुल के '
                  'विनाश और मित्रों के प्रति द्रोह के पाप को नहीं देख '
                  'पा रहे हैं। उनका दृष्टिकोण इतना धुंधला हो गया '
                  'है कि वे सत्य की पहचान नहीं कर पा रहे हैं।\n\n'
                  'इन श्लोकों में अर्जुन की चिंता और दुविधा स्पष्ट रूप '
                  'से प्रकट होती है। वे इस बात को लेकर चिंतित हैं '
                  'कि जो लोग इस युद्ध के परिणामों को नहीं देख पा '
                  'रहे हैं, वे कितने दोषी हैं और किस प्रकार से पाप का '
                  'हिस्सा बन रहे हैं। अर्जुन भगवान श्रीकृष्ण से इस '
                  'स्थिति को स्पष्ट करने की गुजारिश कर रहे हैं ताकि '
                  'सही मार्ग को अपनाया जा सके और कुल के विनाश '
                  'से बचा जा सके। इन श्लोकों से हमें यह भी सिखने '
                  'को मिलता है कि अधर्म के खिलाफ उठ खड़ा होना '
                  'और सही निर्णय लेना कितना महत्वपूर्ण है।',
            ),
            SizedBox(height: 12),
            Text(
              'श्लोक 39:\n'
                  'इस श्लोक में अर्जुन कुलधर्म के संकट पर चिंता '
                  'व्यक्त कर रहे हैं। उनका कहना है कि जब कुलधर्म, '
                  'जो कि परिवार और समाज की नैतिक और धार्मिक '
                  'मान्यताओं का आधार होता है, नष्ट हो जाता है, तो '
                  'इससे कुल की सम्पूर्ण व्यवस्था भी अस्तित्वहीन हो '
                  'जाती है। कुलधर्म का पालन करने से ही एक परिवार '
                  'और समाज की संरचना बनी रहती है। जब धर्म की '
                  'स्थिति कमजोर होती है, तो अधर्म, यानी अनैतिकता '
                  'और भ्रष्टाचार, बढ़ जाता है। इस प्रकार, कुलधर्म की '
                  'रक्षा करना अत्यंत महत्वपूर्ण है, क्योंकि इसके नष्ट '
                  'होने से समाज की स्थिरता और नैतिकता भी खतरे '
                  'में पड़ जाती है।\n\n'
                  'अर्जुन की चिंता इस बात को दर्शाती है कि युद्ध '
                  'परिणामस्वरूप धर्म और नैतिकता की स्थिरता खतरे '
                  'में पड़ सकती है, जो समाज की समृद्धि और '
                  'को प्रभावित कर सकती है।',
            ),
          ],
        ),
      ),
    );
  }
}