import 'package:flutter/material.dart';

class Shlok24_25 extends StatefulWidget {
  const Shlok24_25({super.key});

  @override
  State<Shlok24_25> createState() => _Shlok24_25State();
}

class _Shlok24_25State extends State<Shlok24_25> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        leading: IconButton(
          icon: const Icon(Icons.arrow_back),
          onPressed: () {
            Navigator.pop(context);
          },
        ),
        title: const Text('श्लोक 24, 25'),
      ),
      body: SingleChildScrollView(
        padding: const EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: const [
            Text(
              'श्लोक',
              style: TextStyle(fontSize: 18, fontWeight: FontWeight.bold),
            ),
            Text(
              'संजय उवाच\n'
                  'एवमुक्तो हृषीकेशो गुडाकेशेन भारत।\n'
                  'सेनयोरुभयोर्मध्ये स्थापयित्वा रथोत्तमम्॥\n'
                  'भीष्मद्रोणप्रमुखतः सर्वेषां च महीक्षिताम्।\n'
                  'उवाच पार्थ पश्यैतान् समवेतान् कुरूनिति॥24-25॥', // Sanskrit Shlok 24-25
            ),
            SizedBox(height: 12),
            Text(
              'हिंदी अनुवाद: \n',
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            Text(
              'संजय बोले- हे धृतराष्ट्र! अर्जुन द्वारा कहे अनुसार महाराज '
                  'श्रीकृष्णचंद्र ने दोनों सेनाओं के बीच में भीष्म और '
                  'द्रोणाचार्य के सामने तथा संपूर्ण राजाओं के सामने उत्तम '
                  'रथ को खड़ा कर इस प्रकार कहा कि हे पार्थ! युद्ध के '
                  'लिए जुटे हुए इन कौरवों को देख ॥24-25॥', // Hindi Translation Shlok 24-25
            ),
            SizedBox(height: 20),
            Text(
              'व्याख्या:\n',
              style: TextStyle(fontSize: 16, fontWeight: FontWeight.bold),
            ),
            Text(
              'इस श्लोक में संजय ने धृतराष्ट्र को कुरुक्षेत्र के युद्धस्थल की '
                  'स्थिति की जानकारी दी है। उन्होंने बताया कि कैसे श्रीकृष्ण, '
                  'जो \'हृषीकेश\' नाम से प्रसिद्ध हैं, और अर्जुन, जिनके '
                  '\'गुडाकेश\' नाम से संदर्भित किया गया है, ने युद्ध के '
                  'मैदान में रथ को दोनों सेनाओं के बीच में स्थित किया।\n\n'
                  'इसका अर्थ है कि श्रीकृष्ण ने अर्जुन के अनुरोध पर उनके '
                  'रथ को दोनों पक्षों के मध्य में खड़ा किया, ताकि अर्जुन '
                  'युद्ध की स्थिति को ठीक से देख सकें। यहाँ '
                  '\'रथोत्तमम्\' का तात्पर्य उस रथ से है जो श्रेष्ठ और शानदार '
                  'है, और \'सेनयोरुभयोर्मध्ये\' का मतलब है कि यह रथ दोनों '
                  'सेनाओं के बीच में रखा गया था। इस प्रकार, इस श्लोक के '
                  'माध्यम से यह दर्शाया गया है कि युद्ध की स्थिति को '
                  'समझने और रणनीति बनाने के लिए रथ को एक उपयुक्त स्थान '
                  'पर रखा गया।\n\n'
                  'इस श्लोक में भगवान श्रीकृष्ण अर्जुन से कह रहे हैं कि वे '
                  'युद्धभूमि पर मौजूद सभी योद्धाओं को देखें, जो भीष्म और '
                  'द्रोणाचार्य जैसे प्रमुख योद्धाओं द्वारा नेतृत्व किए जा रहे '
                  'हैं। यहाँ भगवान श्रीकृष्ण अर्जुन को युद्ध की तैयारी '
                  'और सेना की ताकत को दिखाने के लिए कह रहे हैं।\n\n'
                  'इस श्लोक में, "भीष्मद्रोणप्रमुखतः" का अर्थ है कि जो भी '
                  'योद्धा भीष्म और द्रोणाचार्य जैसे प्रमुख सेनानायकों द्वारा '
                  'नेतृत्व किए जा रहे हैं, और "सर्वेषां च महीक्षिताम्" का '
                  'तात्पर्य है कि सभी पृथ्वी के राजा और योद्धा यहाँ एकत्रित '
                  'हैं। भगवान श्रीकृष्ण अर्जुन को कह रहे हैं कि वे उन सभी '
                  'योद्धाओं को ध्यानपूर्वक देखें, जो कुरुक्षेत्र में युद्ध के लिए '
                  'एकत्रित हुए हैं। यह दृश्य अर्जुन के लिए महत्वपूर्ण '
                  'है, ताकि वह युद्ध की वास्तविकता और उसकी गंभीरता को '
                  'समझ सके।',
            ),
          ],
        ),
      ),
    );
  }
}